import csv
from typing import List


def get_csv_rows(filename: str) -> List[List[str]]:
    """
    Читает CSV-файл и возвращает список его строк

    Пример возвращаемого значения:
        [
            ["Семенова Елена", "Математика", "Ковалева Анна", "2023-01-10", "5"],
            ["Белов Станислав", "Литература", "Ткаченко Наталья", "2023-01-11", "4"],
            ["Семенова Елена", "Литература", "Ткаченко Наталья", "2023-01-12", "3"],
            ["Белов Станислав", "Математика", "Ковалева Анна", "2023-01-13", "5"],
        ]

    """

    with open(filename, "r", encoding="utf-8", newline="") as file:
        row = csv.reader(file)
        next(row)  # пропуск заголовка

        return list(row)
